export const data = [
  {
    id: 0,
    title: 'Гипотензивные ЛС',
    bullets: [
      {
        id: 0,
        title: 'Возможная реакция:',
        text: 'У пациентов, получающих некоторые гипотензивные ЛС, возникала симптоматическая постуральная гипотензия',
      },
      {
        id: 1,
        title: 'Рекомендация:',
        text: 'В начале применения комбинации леводопа + карбидопа может потребоваться корректировка дозы гипотензивного ЛС',
      },
    ],
  },
  {
    id: 1,
    title: 'Ингибиторы МАО (тип A или B)',
    bullets: [
      {
        id: 0,
        title: 'Возможная реакция:',
        text: 'Сопутствующее применение селегилина и комбинации леводопа + карбидопа может быть связано с развитием тяжелой ортостатической гипотензии, не ассоциированной только с применением данной комбинации',
      },
    ],
  },
  {
    id: 2,
    title: 'Трициклические антидепрессанты',
    bullets: [
      {
        id: 0,
        title: 'Возможная реакция:',
        text: 'Имеются редкие сообщения о побочных реакциях, включая артериальную гипертензию и дискинезию, в результате одновременного применения трициклических антидепрессантов и ЛС, содержащих комбинацию леводопа + карбидопа',
      },
    ],
  },
  {
    id: 3,
    title:
      'Антагонисты D2-дофаминовых рецепторов (например, фенотиазины, бутирофеноны, рисперидон)',
    bullets: [
      {
        id: 0,
        title: 'Возможная реакция:',
        text: 'Могут снижать терапевтические эффекты леводопы. Кроме того, сообщалось, что положительные эффекты применения леводопы при болезни Паркинсона блокируются при применении фенитоина и папаверина',
      },
      {
        id: 1,
        title: 'Рекомендация:',
        text: 'Пациенты, получающие эти ЛС и комбинацию леводопа + карбидопа, должны находиться под тщательным наблюдением на предмет потери терапевтического ответа',
      },
    ],
  },
  {
    id: 4,
    title: 'Изониазид',
    bullets: [
      {
        id: 0,
        title: 'Возможная реакция:',
        text: 'Могут снижать терапевтические эффекты леводопы. Кроме того, сообщалось, что положительные эффекты применения леводопы при болезни Паркинсона блокируются при применении фенитоина и папаверина',
      },
      {
        id: 1,
        title: 'Рекомендация:',
        text: 'Пациенты, получающие эти ЛС и комбинацию леводопа + карбидопа, должны находиться под тщательным наблюдением на предмет потери терапевтического ответа',
      },
    ],
  },
  {
    id: 5,
    title: 'Антидофаминергические ЛС (например, резерпин и тетрабеназин)',
    bullets: [
      {
        id: 0,
        title: 'Рекомендация:',
        text: 'Не рекомендуется одновременное применение комбинации леводопа + карбидопа и антидофаминергических ЛС (например, резерпин и тетрабеназин) или других ЛС с известной способностью истощать запасы моноаминов',
      },
    ],
  },
  {
    id: 6,
    title: 'Другие ЛС с известной способностью истощать запасы моноаминов',
    bullets: [
      {
        id: 0,
        title: 'Рекомендация:',
        text: 'Не рекомендуется одновременное применение комбинации леводопа + карбидопа и антидофаминергических ЛС (например, резерпин и тетрабеназин) или других ЛС с известной способностью истощать запасы моноаминов',
      },
    ],
  },
  {
    id: 7,
    title: 'ЛС или поливитамины, содержащие соли железа',
    bullets: [
      {
        id: 0,
        title: 'Возможная реакция:',
        text: 'Соли железа могут образовывать хелаты с леводопой и карбидопой и вследствие этого снижать их биодоступность',
      },
      {
        id: 1,
        title: 'Рекомендация:',
        text: 'Следует соблюдать сторожность при одновременном назначении комбинации леводопа + карбидопа и ЛС или поливитаминов, содержащих соли железа',
      },
    ],
  },
  {
    id: 8,
    title: 'Метоклопрамид',
    bullets: [
      {
        id: 0,
        title: 'Возможная реакция:',
        text: 'Метоклопрамид может увеличивать биодоступность леводопы за счет увеличения опорожнения желудка, однако он также может отрицательно влиять на контроль заболевания из-за антагонистического действия по отношению к дофаминовым рецепторам',
      },
    ],
  },
];
