export const data = [
  [
    {
      id: 0,
      title: 'Показания к применению:',
      text: `Поздние стадии леводопа-чувствительной болезни Паркинсона с выраженными двигательными флуктуациями и гипер-/дискинезиями при недостаточной эффективности других противопаркинсонических препаратов`,
    },
    {
      id: 1,
      title: 'Фармакологическая группа:',
      text: ` Противопаркинсоническое средство (дофамина предшественник + декарбоксилаза периферический ингибитор)`,
    },
  ],
  [
    {
      id: 2,
      title: 'Состав:',
      text: `Активное вещество: леводопа 2,00 г; карбидопы моногидрат 0,50 г.\nВспомогательные вещества: кармеллоза натрия 2,92 г, вода 94,58 г.\nВ 1 мл геля содержится: Активное вещество: леводопа 20,0 мг; карбидопы моногидрат 5,00 мг.\nВспомогательные вещества: кармеллоза натрия 29,2 мг, вода до 1 мл.`,
    },
    {
      id: 3,
      title: 'Способ применения и дозы:',
      text: `Перорально, суточная доза должна определяться тщательным титрованием. В период корректировки дозы следует внимательно наблюдать за состоянием пациента, особенно в отношении появления или ухудшения непроизвольных движений, дискинезий или тошноты. Насыщение периферической допа-декарбоксилазы происходит при биодоступной дозе карбидопы 70 мг/сут и выше. Поскольку биодоступность леводопы и карбидопы в разных лекарственных формах различна, необходима соответствующая корректировка дозы. Другие факторы, такие как пища, применение сопутствующих ЛС и индивидуальные различия между пациентами, могут влиять на биодоступность карбидопы и леводопы. Подробная информация о способах применения и дозах указана в инструкции по применению`,
    },
    {
      id: 4,
      title: 'Противопоказания:',
      text: `Подробная информация о противопоказаниях указана в инструкции по применению`,
    },
    {
      id: 5,
      title: 'Условия хранения:',
      text: `При температуре 2–8 °C в защищенном от света месте. Хранить в недоступном для детей месте.`,
    },
    {
      id: 6,
      title: 'ООО "ЭббВи", Россия',
      text: ``,
    },
  ],
];
